Revit 2027 API
IFCData.CreateLogical Method
 Creates a logical data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateLogical(
	IFCLogical value
)
Public Shared Function CreateLogical (
	value As IFCLogical
) As IFCData
public:
static IFCData^ CreateLogical(
	IFCLogical value
)
static member CreateLogical :
        value : IFCLogical -> IFCData
Parameters
value IFCLogical
 The IFCLogical value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace